homework_three/test_ab_guinicorn_proxy_error
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.253 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        nginx/1.18.0
Server Hostname:        192.168.1.253
Server Port:            80

Document Path:          /api
Document Length:        38 bytes

Concurrency Level:      1000
Time taken for tests:   0.720 seconds
Complete requests:      10000
Failed requests:        230
   (Connect: 0, Receive: 0, Length: 230, Exceptions: 0)
Non-2xx responses:      230
Total transferred:      1801630 bytes
HTML transferred:       414040 bytes
Requests per second:    13894.97 [#/sec] (mean)
Time per request:       71.969 [ms] (mean)
Time per request:       0.072 [ms] (mean, across all concurrent requests)
Transfer rate:          2444.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   11   4.4     11      25
Processing:    11   57  11.4     59     116
Waiting:        1   53  10.6     55     101
Total:         25   68  10.7     69     129

Percentage of the requests served within a certain time (ms)
  50%     69
  66%     71
  75%     73
  80%     74
  90%     77
  95%     82
  98%     90
  99%    103
 100%    129 (longest request)